#define _CRT_SECURE_NO_WARNINGS 1


#include<stdio.h>
//
//int main()
//{
//	int a = 10;
//	float f = 10.0;
//
//	return 0;
//}
//整型家族-1.char-2.short/short int-3.int-4.long/long int-(unsigned/signed)
//浮点型家族-1.float-2.double
//整数存放在内存中存的是补码
//大小端介绍
//大端(存储)模式，是指数据的低位保存在内存的高地址中，而数据的高位，保存在内存的低地址中；
//小端(存储)
// \566
// 模式，是指数据的低位保存在内存的低地址中，而数据的高位，保存在内存的高地址中；
//int main()
//{
//	int a = 20;
//	return 0;
//}
//设计一段代码告诉我们当前机器的字节是什么
//int main()
//{
//	int a = 1;
//	char* p = (char*)&a;//int* p=&a;//&a强制类型转换为char*
//	if (*p == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}
//封装函数
//int check_sys()
//{
//	int a = 1;
//	char* p = (char*)&a;
//	//if (*p == 1)
//	//{
//	//	return 1;
//	//}
//	//else
//		//return 0;
//	return *p;
//}
//int check_sys()
//{
//	int a = 1;
//	return *(char*)&a;//直接对强制类型转换的地址解引用
//}
//指针类型的意义
//1.指针类型决定了指针解引用操作符能访问几个字节，char*p;*p访问了1个字节;int*p;*p访问了4个字节
//2.
//int main()
//{
//	//设计一段代码告诉我们当前机器的字节是什么
//	//返回1，小端
//	//返回0，大端
//	int ret = check_sys();
//	if (ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}

//int main()
//{
//	char a = -1;
	//1000 0000 0000 0000 0000 0000 0000 0001
	//1111 1111 1111 1111 1111 1111 1111 1110
	//1111 1111 1111 1111 1111 1111 1111 1111  补码
	//1111 1111 char里储存的内容 右边
	//打印 整型提升
	//1111 1111 1111 1111 1111 1111 1111 1111
	/*signed char b = -1;*/
	//1111 1111 
	//unsigned char c = -1;
	//1111 1111
	//整型提升
	//0000 0000 0000 0000 0000 0000 1111 1111
	//255
//	printf("a=%d,b=%d,c=%d", a, b, c);
//	return 0;
//
//}

//int main()
//{
	//char a = -128;//有符号的char的范围是：-128~127//无符号char的范围是：0~255
	//1000 0000 0000 0000 0000 0000 1000 0000
	//1111 1111 1111 1111 1111 1111 0111 1111
	//1111 1111 1111 1111 1111 1111 1000 0000 -补码
	//1000 0000 char存储
	//整型提升
	//1111 1111 1111 1111 1111 1111 1000 0000-补码
	//无符号 原码等于补码且为整数4294967168
	//printf("%u\n", a);
	//%u-打印十进制的无符号数子
//	return 0;
//}
//int main()
//{
//	char a = 128;//有符号的char只能存到127，127+1为-128，整型提升后为4294967168
//	printf("%u\n",a);
//	return 0;
//}
#include <windows.h>
//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);//9 8 7 6 5 4 3 2 1 0 1 2....
//		Sleep(100);
//	}
	//-1
	//10000000 00000000 00000000 00000001
	//11111111 11111111 11111111 11111110 反码
	//11111111 11111111 11111111 11111111 补码-1
	//11111111 11111111 11111111 11111110 新补码
	//11111111 11111111 11111111 11111101 新反码
	//10000000 00000000 00000000 00000010 -2
//	return 0;
//}
//int main()
//{
//	char a[1000];//1个字节（0-255）
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;//a[0]=-1-0=-1
		              //a[1]=-1-1=-2
		              //a[2]=-1-2=-3
		              //...
		              //a[127]=-1-127=-128//a[]是char类型只能存储到-128
		              //a[128]=-1-128=127
		              //...
		              //a[255]=-1-255=0
	//}
//	printf("%d", strlen(a));//strlen()求字符串长度要找到'\0'
//	return 0;
//}

//unsigned char i = 0;//范围是（0-255）
//int main()
//{
//	for (i = 0; i <= 255; i++)//（255+1=0）
//	{
//		printf("hello world\n");//死循环
//	}
//	return 0;
//}

//浮点数在内存中的存储
//int main()
//{
//	double d = 1E10;//1*10^10
//	printf("%lf\n", d);
//	return 0;
//}
//int main()
//{
//	int n = 9;
	//0 00000000 000000000000000000001001 E全为0 默认为无限小的数字//打印小数点后六位0.000000
//	float* pFloat = (float*)&n;
//	printf("n的值为：%d\n", n);//"%d" "以十进制整数的形式输出"  9
//	printf("*pFloat的值为：%f\n", *pFloat);//*pFloat是整型//"%f""单精度浮点数(默认float)、十进制记数法" 0.000000
	//以整型形式存储，以浮点数形式取出
//	*pFloat = 9.0;
	//存储：(-1)^0*1.001*2^3
	//0 10000010 001000000000000000000000 补码
	//转化为十进制：1091567616
//	printf("num的值为：%d\n", n);//1091567616
	//以浮点数形式存储，以整型形式取出
//	printf("*pFloat的值为：%f\n", *pFloat);//9.000000
//	return 0;
//}
//以上说明浮点数形式的存储方式与整型不同
//9.0
//1001.0 二进制形式
//(-1)^0*1.001*2^3
//(-1)^s*M(M是大于等于1小于2的数）*2^E(E表示指数位)
//int main()
//{
//	float f = 5.5;
//	//101.1
//	//(-1)^0*1.011*2^2
//	return 0;
//}